In [86]:
import pandas as pd
import numpy as np

In [87]:
df = pd.read_csv("Working-age.csv")

print(df.head())

        Code                  Area  Year  \
0  E09000001        City of London  2004
1  E09000002  Barking and Dagenham  2004
2  E09000003                Barnet  2004
3  E09000004                Bexley  2004
4  E09000005                 Brent  2004

  Qualifications of working age population (16-64)  number denominator  \
0                                            NVQ4+   3,500       4,300
1                                            NVQ4+  14,300     101,800
2                                            NVQ4+  77,100     206,600
3                                            NVQ4+  21,400     134,900
4                                            NVQ4+  43,800     178,400

  percent confidence
0    80.6          *
1    14.1          3
2    37.3          4
3    15.8        3.3
4    24.5        3.4

Renaming the 'qualifications of working age population (16-64) to 'Qualifications' to make it easier to work with

In [88]:
df.rename(columns={'Qualifications of working age population (16-64)': 'Qualifications'}, inplace=True)
print(df)

           Code                  Area  Year          Qualifications   number  \
0     E09000001        City of London  2004                   NVQ4+    3,500
1     E09000002  Barking and Dagenham  2004                   NVQ4+   14,300
2     E09000003                Barnet  2004                   NVQ4+   77,100
3     E09000004                Bexley  2004                   NVQ4+   21,400
4     E09000005                 Brent  2004                   NVQ4+   43,800
...         ...                   ...   ...                     ...      ...
6239  S92000003              Scotland  2021  with no qualifications   263800
6240  N92000002      Northern Ireland  2021  with no qualifications   137100
6241  K04000001     England and Wales  2021  with no qualifications  2368400
6242  K03000001         Great Britain  2021  with no qualifications  2632300
6243  K02000001        United Kingdom  2021  with no qualifications  2769400

     denominator percent confidence
0          4,300    80.6          *
1        101,800    14.1          3
2        206,600    37.3          4
3        134,900    15.8        3.3
4        178,400    24.5        3.4
...          ...     ...        ...
6239     3405000     7.7        0.8
6240     1153800    11.9        1.4
6241    36614900     6.5        0.2
6242    40019900     6.6        0.2
6243    41173700     6.7        0.2

[6244 rows x 8 columns]

Dropping Columns that are not relevant

- Dropping the ID Column as this is just an identifier column, and wont be relevant for the analysis
- Does not impact the result/analysis

In [89]:
df.drop(columns=["Code"], inplace=True)
df.drop(columns=["confidence"], inplace=True)

In [90]:
df.shape

(6244, 6)

Some values have commas for when they are thousands and hundred
- We need these are whole numbers to avoid issues with analysis

In [91]:
df["number"] = df["number"].str.replace(",", "")
df["denominator"] = df["denominator"].str.replace(",", "")

In [92]:
df

,Area,Year,Qualifications,number,denominator,percent
0,City of London,2004,NVQ4+,3500,4300,80.6
1,Barking and Dagenham,2004,NVQ4+,14300,101800,14.1
2,Barnet,2004,NVQ4+,77100,206600,37.3
3,Bexley,2004,NVQ4+,21400,134900,15.8
4,Brent,2004,NVQ4+,43800,178400,24.5
...,...,...,...,...,...,...
6239,Scotland,2021,with no qualifications,263800,3405000,7.7
6240,Northern Ireland,2021,with no qualifications,137100,1153800,11.9
6241,England and Wales,2021,with no qualifications,2368400,36614900,6.5
6242,Great Britain,2021,with no qualifications,2632300,40019900,6.6
6243,United Kingdom,2021,with no qualifications,2769400,41173700,6.7

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6244 entries, 0 to 6243
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Area            6244 non-null   object
 1   Year            6244 non-null   int64
 2   Qualifications  6244 non-null   object
 3   number          6244 non-null   object
 4   denominator     6244 non-null   object
 5   percent         6244 non-null   object
dtypes: int64(1), object(5)
memory usage: 292.8+ KB

Check for null values
- we have some values where there are null values, but they have been replaced with ! 
- replacing these with Nan to identify the null values

In [94]:
df.replace("!", np.nan, inplace=True)
df.replace("~", np.nan, inplace=True)
df.replace("#", np.nan, inplace=True)

Count of the null Values

In [95]:
print(df.isnull().sum())

Area                0
Year                0
Qualifications      0
number            198
denominator         0
percent           193
dtype: int64

In [96]:
df.shape

(6244, 6)

Deleting the rows with Null values

In [97]:
df.dropna(inplace=True)

In [98]:
df.shape

(6046, 6)

In [99]:
print(df.isnull().sum())

Area              0
Year              0
Qualifications    0
number            0
denominator       0
percent           0
dtype: int64

Checking Datatypes

In [100]:
df.dtypes

Area              object
Year               int64
Qualifications    object
number            object
denominator       object
percent           object
dtype: object

Some columns do not have the correct datatype, so we will convert them

In [101]:
df["number"].astype('int64')

0          3500
1         14300
2         77100
3         21400
4         43800
         ...
6239     263800
6240     137100
6241    2368400
6242    2632300
6243    2769400
Name: number, Length: 6046, dtype: int64

In [102]:
#Converting to category Datatype
df["Area"] = df["Area"].astype('category')
df["Year"] = df["Year"].astype('category')
df["Qualifications"] = df["Qualifications"].astype('category')

#Converting to integers / float
df["number"] = df["number"].astype('int')
df["denominator"] = df["denominator"].astype('int64')
df["percent"] = df["percent"].astype('float')

In [103]:
df.dtypes

Area              category
Year              category
Qualifications    category
number               int64
denominator          int64
percent            float64
dtype: object

In [104]:
df

,Area,Year,Qualifications,number,denominator,percent
0,City of London,2004,NVQ4+,3500,4300,80.6
1,Barking and Dagenham,2004,NVQ4+,14300,101800,14.1
2,Barnet,2004,NVQ4+,77100,206600,37.3
3,Bexley,2004,NVQ4+,21400,134900,15.8
4,Brent,2004,NVQ4+,43800,178400,24.5
...,...,...,...,...,...,...
6239,Scotland,2021,with no qualifications,263800,3405000,7.7
6240,Northern Ireland,2021,with no qualifications,137100,1153800,11.9
6241,England and Wales,2021,with no qualifications,2368400,36614900,6.5
6242,Great Britain,2021,with no qualifications,2632300,40019900,6.6
6243,United Kingdom,2021,with no qualifications,2769400,41173700,6.7

In [105]:

df['Qualifications'].nunique()

11

we should only have 7 unique elements in the qualifications column but we have 11

In [106]:

values = df['Qualifications'].astype(str).unique()
print(values)

['NVQ4+' 'NVQ3 only' 'Trade Apprenticeships' 'NVQ2 only' 'NVQ1 only'
 'with other qualifications' 'with no qualifications' 'NVQ2 only '
 'other qualifications' 'no qualifications' ' NVQ4+ ']

We have repeated elements
- 'NVQ4+' and 'NVQ4+ '
- 'no qualifications' and 'with no qualifications'
- 'other qualifications' and 'with other qualifications'
- Removing 'only'

In [ ]:
df['Qualifications'] = df['Qualifications'].str.strip() #removing extra spaces
df["Qualifications"] = df["Qualifications"].str.replace("only ", "") #removing 'only'
df["Qualifications"] = df["Qualifications"].str.replace("with ", "") #removing 'with'

In [108]:
values = df['Qualifications'].astype(str).unique()
print(values)

['NVQ4+' 'NVQ3 only' 'Trade Apprenticeships' 'NVQ2 only' 'NVQ1 only'
 'other qualifications' 'no qualifications']

In [109]:
df['Qualifications'].nunique()

7

In [110]:
df.to_csv("transformed.csv")